Tekla Open API Reference for Tekla Structures 2025
AnalysisResult Properties
The AnalysisResult type exposes the following members.
Properties
Name | Description
LoadCase
 The load case. The real load cases have positive values 1, 2, 3, ... For min/max queries LoadCaseForMinMaxEnum can be used.
LoadCaseInfo
 The load case info (optional, max length 128).
LoadCaseName
 The load case name (max length 64).
LoadCaseType
 The load case type.
ModId
 The time stamp of the result.
ObjectId
 The identifier of the object. If ObjectType is OBJECT_TYPE_PART, ObjectId is (physical) part ID. If ObjectType is OBJECT_TYPE_MEMBER, ObjectId is the bar number when analysis bars are used in integration, otherwise ObjectId is the member number. If ObjectType is OBJECT_TYPE_AREA, ObjectId is the area number.
ObjectType
 The object type. In result query the only supported type is the physical member (the part).
Position
 The position on the part's START/END/...
PositionCoordX
 Global coordinate X (mm) when inserting result. Local (part) coordinate X (mm) when getting results.
PositionCoordY
 Global coordinate Y (mm) when inserting result. Local (part) coordinate Y (mm) when getting results.
PositionCoordZ
 Global coordinate Z (mm) when inserting result. Local (part) coordinate Z (mm) when getting results.
PositionTolerance
 The position's coordinate tolerance.
Value
 The result value.
ValueType
 The result value type.
Top
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace